In [6]:
import pandas as pd

total = 0

# values gathered from https://oakland.edu/financialservices/costs/tuition-rates/
# for simplicity all credits taken are assumed to be taken by residents

# College of Arts and Sciences
lcas = 507.5
ucas = 587.75

# School of Education and Human Services
lsehs = 507.5
usehs = 587.75

# School of Business Administration
lsba = 529.25
usba = 622.25

# School of Engineering and Computer Science
lsecs = 540.25
usecs = 635.75

# School of Health Sciences
lshs = 522.00
ushs = 610.25

# School of Nursing
lsn = 534.75
usn = 627.5

# Graduate Tuition
gst = 871.5

In [7]:
# get file path and read file
file_path = r'.\\\Fall_2023-Enrollment-Summary_Detail.xlsx'
enrollment_data = pd.read_excel(file_path)

# output temp to ensure 
enrollment_data.head()

,Coll. School,Div.,Dept.,Part of Term,Instructor Last Name,Instructor First Name,Subject,Course Number,CRN Key,Campus,INSTRUCTION_FORMAT,Enrolled,Credits,FYES
0,AA,AA,IE,Study Abroad,Zimmerman,Alex,SAB,2010,45734.0,International,Other,1,16,0.533333
1,AA,AA,IE,Study Abroad,Zimmerman,Alex,SAB,2010,45735.0,International,Other,1,15,0.500000
2,AA,AA,IE,Study Abroad,Zimmerman,Alex,SAB,2010,45736.0,International,Other,1,15,0.500000
3,AA,AA,IE,Study Abroad,Zimmerman,Alex,SAB,2010,45737.0,International,Other,1,12,0.400000
4,AA,AA,IE,Study Abroad,Zimmerman,Alex,SAB,2010,45738.0,International,Other,1,13,0.433333

In [8]:
# create better dataset
filtered_data = enrollment_data.dropna()
filtered_data['Course Number'] = filtered_data['Course Number'].astype(str).str.replace(r'\D', '', regex=True)
filtered_data['Course Number'] = filtered_data['Course Number'].astype(int)

filtered_data.head()

C:\Users\Zack\AppData\Local\Temp\ipykernel_33528\3382964238.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  filtered_data['Course Number'] = filtered_data['Course Number'].astype(str).str.replace(r'\D', '', regex=True)
C:\Users\Zack\AppData\Local\Temp\ipykernel_33528\3382964238.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  filtered_data['Course Number'] = filtered_data['Course Number'].astype(int)

,Coll. School,Div.,Dept.,Part of Term,Instructor Last Name,Instructor First Name,Subject,Course Number,CRN Key,Campus,INSTRUCTION_FORMAT,Enrolled,Credits,FYES
0,AA,AA,IE,Study Abroad,Zimmerman,Alex,SAB,2010,45734.0,International,Other,1,16,0.533333
1,AA,AA,IE,Study Abroad,Zimmerman,Alex,SAB,2010,45735.0,International,Other,1,15,0.500000
2,AA,AA,IE,Study Abroad,Zimmerman,Alex,SAB,2010,45736.0,International,Other,1,15,0.500000
3,AA,AA,IE,Study Abroad,Zimmerman,Alex,SAB,2010,45737.0,International,Other,1,12,0.400000
4,AA,AA,IE,Study Abroad,Zimmerman,Alex,SAB,2010,45738.0,International,Other,1,13,0.433333

In [9]:
# get sum of credits for school of arts and sciences
lcas_total = filtered_data.loc[(filtered_data['Coll. School'] == 'AS') & (filtered_data['Course Number'] < 3000), 'Credits'].sum() * lcas
ucas_total = filtered_data.loc[(filtered_data['Coll. School'] == 'AS') & (filtered_data['Course Number'] >= 3000) & (filtered_data['Course Number'].astype(int) < 5000), 'Credits'].sum() * ucas
total = lcas_total + ucas_total
total

51819857.0

In [10]:
# get sum of credits for school of business administration
lsba_total = filtered_data.loc[(filtered_data['Coll. School'] == 'BA') & (filtered_data['Course Number'] < 3000), 'Credits'].sum() * lsba
usba_total = filtered_data.loc[(filtered_data['Coll. School'] == 'BA') & (filtered_data['Course Number'] >= 3000 & (filtered_data['Course Number'].astype(int) < 5000)), 'Credits'].sum() * usba
total += lsba_total + usba_total
total

67945740.25

In [11]:
# get sum of credits for school of education
lsehs_total = filtered_data.loc[(filtered_data['Coll. School'] == 'ED') & (filtered_data['Course Number'] < 3000), 'Credits'].sum() * lsehs
usehs_total = filtered_data.loc[(filtered_data['Coll. School'] == 'ED') & (filtered_data['Course Number'] >= 3000 & (filtered_data['Course Number'].astype(int) < 5000)), 'Credits'].sum() * usehs
total += lsehs_total + usehs_total
total

76080079.75

In [12]:
# get sum of credits for school of engineering
lsecs_total = filtered_data.loc[(filtered_data['Coll. School'] == 'EG') & (filtered_data['Course Number'] < 3000), 'Credits'].sum() * lsecs
usecs_total = filtered_data.loc[(filtered_data['Coll. School'] == 'EG') & (filtered_data['Course Number'] >= 3000 & (filtered_data['Course Number'].astype(int) < 5000)), 'Credits'].sum() * usecs
total += lsecs_total + usecs_total
total

91178639.0

In [13]:
# get sum of credits for school of health sciences
lshs_total = filtered_data.loc[(filtered_data['Coll. School'] == 'HS') & (filtered_data['Course Number'] < 3000), 'Credits'].sum() * lshs
ushs_total = filtered_data.loc[(filtered_data['Coll. School'] == 'HS') & (filtered_data['Course Number'] >= 3000 & (filtered_data['Course Number'].astype(int) < 5000)), 'Credits'].sum() * ushs
total += lshs_total + ushs_total
total

99994403.75

In [14]:
# get sum of credits for school of nursing
lsn_total = filtered_data.loc[(filtered_data['Coll. School'] == 'NR') & (filtered_data['Course Number'] < 3000), 'Credits'].sum() * lsn
lsn_total = filtered_data.loc[(filtered_data['Coll. School'] == 'NR') & (filtered_data['Course Number'] >= 3000 & (filtered_data['Course Number'].astype(int) < 5000)), 'Credits'].sum() * usn
total += lsn_total + lsn_total
total

114056678.75

In [15]:
# get sum of credits for grad school
gst_total = filtered_data.loc[(filtered_data['Course Number'] > 5000), 'Credits'].sum() * gst
total += gst_total
total

130676183.75